{
  "basics": {
    "name": "Aaron Herres",
    "label": "A full-stack, team-building software developer with an interest in software architecture, research and development, and coding philosophy. ",
    "picture": "",
    "email": "iam@aaronherres.com",
    "phone": "602-420-3865",
    "website": "",
    "summary": "A software developer with over 20 years experience. A generalist, Aaron has worked in a variety of work environments ranging from startups to large corporations. Aaron's passion for generalism and minimalist design has allowed him to work on projects ranging from microcontrollers to the development of on-premise large cloud computing clusters. Aaron also loves leading teams, as it gives him a captive audience to discuss software development philosophy and exercise his strategies for delivering low-defect software quickly.",
    "location": {
      "countryCode": "US",
      "address": "United States"
    },
    "profiles": [
      {
        "network": "github",
        "username": "redaphid",
        "url": "https://github.com/redaphid"
      },
      {
        "network": "twitter",
        "username": "redaphid",
        "url": "https://twitter.com/redaphid"
      }
    ]
  },
  "work": [
    {
      "company": "Loqwai",
      "name": "Loqwai",
      "skills": [
        "Typescript",
        "Microcontrollers",
        "C++",
        "IPFS"
      ],
      "position": "Software Consultant",
      "startDate": "2021-11-01",
      "summary": "Currently working as a self-employed software consultant on a few projects for clients, including product design consulting for startups, microcontroller development and architecture for an open-source IoT farming project, and software development and docker infrastructure for a decentralized storage project."
    },
    {
      "company": "Magic Leap",
      "name": "Magic Leap",
      "endDate": "2021-04-01",
      "skills": [
        "Node",
        "Golang",
        "C++",
        "Javascript",
        "Typescript"
      ],
      "position": "Team Lead",
      "startDate": "2019-03-04",
      "summary": "Acted as a lead developer for the backend of a collaborative augmented reality cloud platform. Helped form the culture of the team, as well as develop and design the product.\n\nInstilled an effective, collaborative team culture featuring test-driven Unix philosophy with an agile development cycle.\n\nStitched together the real and virtual worlds via the magic of augmented reality goggles.\n\nFocused on making augmented reality less lonely by enabling shared experiences - persistent augmented reality worlds multiple users could see and interact with.",
      "website": "https://www.magicleap.com/"
    },
    {
      "company": "Citrix",
      "name": "Citrix",
      "endDate": "2017-11-30",
      "skills": [
        "C++",
        "Javascript",
        "Coffeescript"
      ],
      "position": "Staff Software Engineer",
      "startDate": "2014-12-31",
      "summary": "Full stack design and development of the Octoblu Designer, a flow-based visual editor that connects of hundreds of different devices and services to each other without code. \n\nFlows run in the cloud, allowing execution of arbitrary flows created by users securely and efficently due to our massively parallelizable architecture. Design of the domain-specific language used by the Octoblu Designer. The designer ran on top of Meshblu, the open source IoT platform described below.",
      "website": "https://octoblu.github.io/"
    },
    {
      "company": "Octoblu",
      "name": "Octoblu",
      "endDate": "2014-12-31",
      "skills": [
        "Node",
        "C++",
        "Javascript",
        "Coffeescript"
      ],
      "position": "Software Consultant",
      "startDate": "2014-03-31",
      "summary": "Full stack development of Meshblu, an internet of things platform, and development work on practical solutions based on that platform. \n\nMeshblu can connect hundreds different of services, internet of things devices, and hobby projects to each by translating them to a common messaging system.\n\nThis system was acquired by Citrix, who then developed the commercial frontend \"Octoblu\" mentioned in the Citrix section. The public instance of the Meshblu platform processed over 4 million messages per hour.",
      "website": "https://octoblu.github.io/"
    },
    {
      "company": "Unicon, Inc.",
      "name": "Unicon, Inc.",
      "endDate": "2014-05-31",
      "skills": [
        "Java",
        "Javascript",
        "HTML"
      ],
      "position": "Software Developer",
      "startDate": "2013-08-31",
      "summary": "Developed and consulted for an open source education portal. Worked on the security on the platform, as well as front and backend work with Java/Spring.",
      "website": "https://www.unicon.net/"
    },
    {
      "company": "Omedix",
      "name": "Omedix",
      "endDate": "2013-04-30",
      "skills": [
        "Java",
        "Javascript"
      ],
      "position": "Software Architect",
      "startDate": "2010-09-01",
      "summary": "Helped design the Omedix Engage platform, which managed patient and practice portals for the healthcare industry. Wrote systems that handled sensitive healthcare data securely.\n\nDesigned the \"Black Box\", a physical network appliance installed in the datacenter of a medical practice that securely connected their electronic medical system to the Omedix Engage platform.\n\nDesigned 2 domain-specific languages to build custom patient forms for medical practices.\n\nActed as a liaison for Omedix Team India, offering tutorials and designs to teams on the other side of the world.",
      "website": "https://www.linkedin.com/company/omedix/"
    },
    {
      "company": "University of Hawaii Manoa",
      "name": "Coherence-Based Modeling of Cultural Change and Political Violence (CCPV) project",
      "endDate": "2010-08-31",
      "skills": [
        "Java",
        "HTML",
        "Python"
      ],
      "position": "Software Developer",
      "startDate": "2009-01-31",
      "summary": "Designed and developed an intelligent, plugin-based web crawler that used existing algorithms from social sciences to extract semantic meaning from natural language conversations on the web. \n\nInformally described as \"finding terrorists on the internet\", the system would trace the origin and spread of extremist ideas. Funded by the Air Force Office of Scientific Research.",
      "website": "https://en.wikipedia.org/wiki/Laboratory_for_Interactive_Learning_Technologies"
    },
    {
      "company": "Laboratory for Interactive Learning Technologies",
      "name": "Laboratory for Interactive Learning Technologies",
      "endDate": "2009-01-31",
      "skills": [
        "C++",
        "Android",
        "Java"
      ],
      "position": "Research Assistant",
      "startDate": "2008-08-31",
      "summary": "Performed research and development on augmented reality for mobile platforms. Designed an application to recognize nametags of users and augmented nametags with information of the wearer of the nametag.",
      "website": "https://en.wikipedia.org/wiki/Laboratory_for_Interactive_Learning_Technologies"
    },
    {
      "company": "Avanade",
      "name": "Avanade",
      "endDate": "2008-08-01",
      "skills": [
        "C#",
        ".NET",
        "SQL"
      ],
      "position": "Solution Developer",
      "startDate": "2007-08-01",
      "summary": "Contract developer for Microsoft, working on disaster recovery and EULA-generation projects in C# and ASP.NET",
      "website": "https://www.avanade.com/"
    },
    {
      "company": "University of Puget Sound",
      "name": "University of Puget Sound",
      "endDate": "2007-05-31",
      "skills": [
        "C++",
        "Ruby",
        "Python"
      ],
      "position": "Software Developer",
      "startDate": "2003-08-31",
      "summary": "Developed a system responsible for managing internet connections for thousands of students. The system automatically scans each connected computer for vulnerabilities, moving vulnerable devices to a network that limited access to only security updating sites until the device is no longer vulnerable.\n\nInterfaced with smart routers through SNMP.",
      "website": "https://www.pugetsound.edu/"
    },
    {
      "company": "Software Development Alternatives",
      "name": "Software Development Alternatives",
      "endDate": "2003-01-31",
      "skills": [
        "C++",
        "Ada"
      ],
      "position": "Software Developer",
      "startDate": "2001-12-31",
      "summary": "Tested and fixed bugs for the Flight Management System of Airbus A320 aircraft, including some feature development. Subcontracted from Honeywell.",
      "website": "https://www.s-d-a-inc.com"
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "University of Hawaii at Manoa",
      "area": "Computer Science",
      "studyType": "Master of Science",
      "startDate": "2008-08-01",
      "endDate": "2010-05-01",
      "gpa": "",
      "courses": []
    },
    {
      "institution": "University of Puget Sound",
      "area": "Computer Science",
      "studyType": "Bachelor of Science",
      "startDate": "2003-08-01",
      "endDate": "2007-05-01",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Typescript",
      "level": "",
      "skills": []
    },
    {
      "name": "Augmented Reality (AR)",
      "level": "",
      "skills": []
    },
    {
      "name": "Go (Programming Language)",
      "level": "",
      "skills": []
    },
    {
      "name": "Microservices",
      "level": "",
      "skills": []
    },
    {
      "name": "Team Leadership",
      "level": "",
      "skills": []
    },
    {
      "name": "Software Design",
      "level": "",
      "skills": []
    },
    {
      "name": "And others..."
    }
  ],
  "languages": [
    {
      "language": "en",
      "fluency": "Native Speaker"
    }
  ],
  "interests": []
}
